config.org
#+TITLE: Tikz Configuration
#+PROPERTY: header-args:latex+ :tangle config.tex
#+PROPERTY: header-args:latex+ :exports code

* Packages
#+begin_src latex
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}

\usepackage[french, english]{babel} % Last language is main language

\usepackage{lmodern} % Latin Modern Font
\usepackage{gensymb} % Generic symbols for both text and math mode

\usepackage{standalone} % Used to generate standalone Tikz

\usepackage{amsmath}   % Main math Package
\usepackage{mathtools} % Extension package to amsmath
\usepackage{amsthm}    % Typesetting theorems (AMS style)
\usepackage{amsfonts}  % More fonts from the AMS
\usepackage{textcomp}  % provide many text symbols
\usepackage{steinmetz} % For phase symbol

\usepackage{xstring}  % Utils to manipulate strings
\usepackage{etoolbox} % Add basic if/then
\usepackage{esvect}   % Beautyfull vectors
\usepackage{graphicx} % Enhanced support for graphics
\usepackage{grffile}  % Used by matlab2tikz

\usepackage{microtype} % typographic tuning
\usepackage{setspace}  % for line spacing, e.g. \onehalfspacing
\usepackage{tabularx}  % table features
\usepackage{enumitem}  % for simple list modifications
\usepackage{booktabs}  % better table support

\usepackage{stackengine} %

\usepackage[load-configurations=abbreviations]{siunitx} % SI units
\sisetup{
    locale = US,
    detect-all,
    range-phrase=--,
    range-units=single
}
#+end_src

* Tikz related packages
#+begin_src latex
  \usepackage{tikz}       % Tikz
  \usepackage{tikzscale}  % Used to scale Tikz graphics
  \usepackage{adjustbox}  % Used to proper positioning of tikz pictures
  \usepackage{circuitikz} % Draw electronic circuits
  \usepackage{pgfpages}   % Needed to use notes
  \usepackage{pgfplots}   % Used to plot functions
#+end_src

* Tikz Libraries
#+begin_src latex
  \usetikzlibrary{arrows}                   % Arrow tip library
  \usetikzlibrary{arrows.meta}              % Add some arrows
  \usetikzlibrary{calc}                     % The library allows advanced Coordinate Calculations
  \usetikzlibrary{intersections}            % calculate intersections of paths
  \usetikzlibrary{matrix}                   %
  \usetikzlibrary{patterns}                 %
  \usetikzlibrary{shapes}                   % Defines circle and rectangle
  \usetikzlibrary{shapes.geometric}         % Use for the shape diamond and isosceles triangle
  \usetikzlibrary{snakes}                   % snake=coil and snake=zigzag using segment amplitude=10pt
  \usetikzlibrary{positioning}              % Additional options for placing nodes
  \usetikzlibrary{3d}                       % Plot 3D shapes
  \usetikzlibrary{spy}                      % Creating a magnified area
  \usetikzlibrary{decorations.text}         % Used to make text follows a curve
  \usetikzlibrary{decorations.pathmorphing} % deformation of a path
  \usetikzlibrary{decorations.markings}     % Used for spring and damper
  \usetikzlibrary{babel}                    % A tiny library that make the interaction with the babel package easier
  \usetikzlibrary{plotmarks}                % This library defines a number of plot marks
  \usetikzlibrary{fit}                      % Used to make rectangle as nodes by specifying two points
  \usetikzlibrary{backgrounds}              % Used to put things under others
#+end_src

