docs/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-20 dim. 18:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tikz Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas Dehaeze" />
</head>
<body>
<div id="content">
<h1 class="title">Tikz Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org44cd92e">1. Packages</a></li>
<li><a href="#orga5488e7">2. Tikz related packages</a></li>
<li><a href="#org00fbbaf">3. Tikz Libraries</a></li>
<li><a href="#org12c1bed">4. PGF Plot libraries and config</a></li>
<li><a href="#orga2c6418">5. Setup size of figures</a></li>
<li><a href="#org1f4fe8c">6. Setup Arrows style</a></li>
<li><a href="#orgc5b3a4c">7. Colors</a></li>
<li><a href="#org169eb66">8. Control</a>
<ul>
<li><a href="#orgbf60a45">8.1. Blocks</a></li>
<li><a href="#orge44fac1">8.2. Branches</a></li>
<li><a href="#org8c172b7">8.3. <span class="todo TODO">TODO</span> Hand Writen Style</a></li>
<li><a href="#orgadbcc0b">8.4. Dot</a></li>
<li><a href="#org5c2d3e7">8.5. DAC</a></li>
<li><a href="#org245e864">8.6. ADC</a></li>
<li><a href="#orgfad8ac6">8.7. <span class="todo TODO">TODO</span> Gain</a></li>
<li><a href="#org64f5f90">8.8. Pole</a></li>
<li><a href="#org6e406e8">8.9. Zero</a></li>
<li><a href="#org0f5613d">8.10. Add / Substract / Divide / Multiply block</a></li>
</ul>
</li>
<li><a href="#org27aaf30">9. Mechanical</a>
<ul>
<li><a href="#orgd35493b">9.1. Spring</a></li>
<li><a href="#org9a83c4e">9.2. Coil</a></li>
<li><a href="#orge84edbc">9.3. Damper</a></li>
<li><a href="#org7ffebc5">9.4. Actuator</a></li>
<li><a href="#org316cb66">9.5. Ground</a></li>
<li><a href="#org16def75">9.6. Force Sensor</a></li>
<li><a href="#orgbb00e6e">9.7. Inertial Sensor</a></li>
<li><a href="#org20d348f">9.8. Axis Rotator</a></li>
<li><a href="#org6ec6df7">9.9. Cross</a></li>
<li><a href="#org0f427ff">9.10. Voice coil</a></li>
</ul>
</li>
<li><a href="#orgca181f8">10. Optics</a></li>
<li><a href="#org636c9ce">11. Misc</a></li>
</ul>
</div>
</div>

<div id="outline-container-org44cd92e" class="outline-2">
<h2 id="org44cd92e"><span class="section-number-2">1</span> Packages</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #0000FF;">\usepackage</span>[<span style="color: #BA36A5;">utf8</span>]{<span style="color: #006699;">inputenc</span>}
<span style="color: #0000FF;">\usepackage</span>[<span style="color: #BA36A5;">T1</span>]{<span style="color: #006699;">fontenc</span>}

<span style="color: #0000FF;">\usepackage</span>[<span style="color: #BA36A5;">french, english</span>]{<span style="color: #006699;">babel</span>} <span style="color: #8D8D84; font-style: italic;">% Last language is main language</span>

<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">lmodern</span>} <span style="color: #8D8D84; font-style: italic;">% Latin Modern Font</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">gensymb</span>} <span style="color: #8D8D84; font-style: italic;">% Generic symbols for both text and math mode</span>

<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">standalone</span>} <span style="color: #8D8D84; font-style: italic;">% Used to generate standalone Tikz</span>

<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">amsmath</span>}   <span style="color: #8D8D84; font-style: italic;">% Main math Package</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">mathtools</span>} <span style="color: #8D8D84; font-style: italic;">% Extension package to amsmath</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">amsthm</span>}    <span style="color: #8D8D84; font-style: italic;">% Typesetting theorems (AMS style)</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">amsfonts</span>}  <span style="color: #8D8D84; font-style: italic;">% More fonts from the AMS</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">textcomp</span>}  <span style="color: #8D8D84; font-style: italic;">% provide many text symbols</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">steinmetz</span>} <span style="color: #8D8D84; font-style: italic;">% For phase symbol</span>

<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">xstring</span>}  <span style="color: #8D8D84; font-style: italic;">% Utils to manipulate strings</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">etoolbox</span>} <span style="color: #8D8D84; font-style: italic;">% Add basic if/then</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">esvect</span>}   <span style="color: #8D8D84; font-style: italic;">% Beautyfull vectors</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">graphicx</span>} <span style="color: #8D8D84; font-style: italic;">% Enhanced support for graphics</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">grffile</span>}  <span style="color: #8D8D84; font-style: italic;">% Used by matlab2tikz</span>

<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">microtype</span>} <span style="color: #8D8D84; font-style: italic;">% typographic tuning</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">setspace</span>}  <span style="color: #8D8D84; font-style: italic;">% for line spacing, e.g. </span><span style="color: #8D8D84; font-style: italic;">\onehalfspacing</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">tabularx</span>}  <span style="color: #8D8D84; font-style: italic;">% table features</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">enumitem</span>}  <span style="color: #8D8D84; font-style: italic;">% for simple list modifications</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">booktabs</span>}  <span style="color: #8D8D84; font-style: italic;">% better table support</span>

<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">stackengine</span>} <span style="color: #8D8D84; font-style: italic;">%</span>

<span style="color: #0000FF;">\usepackage</span>[<span style="color: #BA36A5;">load-configurations=abbreviations</span>]{<span style="color: #006699;">siunitx</span>} <span style="color: #8D8D84; font-style: italic;">% SI units</span>
<span style="color: #FF5500;">\sisetup</span>{
    locale = US,
    detect-all,
    range-phrase=--,
    range-units=single
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga5488e7" class="outline-2">
<h2 id="orga5488e7"><span class="section-number-2">2</span> Tikz related packages</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">tikz</span>}       <span style="color: #8D8D84; font-style: italic;">% Tikz</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">tikzscale</span>}  <span style="color: #8D8D84; font-style: italic;">% Used to scale Tikz graphics</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">adjustbox</span>}  <span style="color: #8D8D84; font-style: italic;">% Used to proper positioning of tikz pictures</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">circuitikz</span>} <span style="color: #8D8D84; font-style: italic;">% Draw electronic circuits</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">pgfpages</span>}   <span style="color: #8D8D84; font-style: italic;">% Needed to use notes</span>
<span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">pgfplots</span>}   <span style="color: #8D8D84; font-style: italic;">% Used to plot functions</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org00fbbaf" class="outline-2">
<h2 id="org00fbbaf"><span class="section-number-2">3</span> Tikz Libraries</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\usetikzlibrary</span>{arrows}                   <span style="color: #8D8D84; font-style: italic;">% Arrow tip library</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{arrows.meta}              <span style="color: #8D8D84; font-style: italic;">% Add some arrows</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{calc}                     <span style="color: #8D8D84; font-style: italic;">% The library allows advanced Coordinate Calculations</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{intersections}            <span style="color: #8D8D84; font-style: italic;">% calculate intersections of paths</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{matrix}                   <span style="color: #8D8D84; font-style: italic;">%</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{patterns}                 <span style="color: #8D8D84; font-style: italic;">%</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{shapes}                   <span style="color: #8D8D84; font-style: italic;">% Defines circle and rectangle</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{shapes.geometric}         <span style="color: #8D8D84; font-style: italic;">% Use for the shape diamond and isosceles triangle</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{snakes}                   <span style="color: #8D8D84; font-style: italic;">% snake=coil and snake=zigzag using segment amplitude=10pt</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{positioning}              <span style="color: #8D8D84; font-style: italic;">% Additional options for placing nodes</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{3d}                       <span style="color: #8D8D84; font-style: italic;">% Plot 3D shapes</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{spy}                      <span style="color: #8D8D84; font-style: italic;">% Creating a magnified area</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{decorations.text}         <span style="color: #8D8D84; font-style: italic;">% Used to make text follows a curve</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{decorations.pathmorphing} <span style="color: #8D8D84; font-style: italic;">% deformation of a path</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{decorations.markings}     <span style="color: #8D8D84; font-style: italic;">% Used for spring and damper</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{babel}                    <span style="color: #8D8D84; font-style: italic;">% A tiny library that make the interaction with the babel package easier</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{plotmarks}                <span style="color: #8D8D84; font-style: italic;">% This library defines a number of plot marks</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{fit}                      <span style="color: #8D8D84; font-style: italic;">% Used to make rectangle as nodes by specifying two points</span>
<span style="color: #FF5500;">\usetikzlibrary</span>{backgrounds}              <span style="color: #8D8D84; font-style: italic;">% Used to put things under others</span>
</pre>
</div>
</div>
</div>
