config.org
* PGF Plot libraries and config
#+begin_src latex
  \usepgfplotslibrary{patchplots}
  \usepgfplotslibrary{groupplots}

  \pgfplotsset{compat=newest}
  \pgfplotsset{plot coordinates/math parser=false}
#+end_src

* Setup size of figures
#+begin_src latex
  \newlength{\fheight}
  \newlength{\fwidth}

  \setlength{\fwidth}{85mm}
  \setlength{\fheight}{112mm}
#+end_src

* Setup Arrows style
#+begin_src latex
  \tikzset{>=Stealth}
  % Setup default Linewidth
  \tikzset{every path/.style={line width=1pt}}
#+end_src

* Colors
#+begin_src latex
  \usepackage{xcolor}% Color extension

  \definecolor{colorblack}{rgb}{0, 0, 0}
  \definecolor{colorblue}{rgb}{0, 0.4470, 0.7410}
  \definecolor{colorred}{rgb}{0.8500, 0.3250, 0.0980}
  \definecolor{coloryellow}{rgb}{0.9290, 0.6940, 0.1250}
  \definecolor{colorpurple}{rgb}{0.4940, 0.1840, 0.5560}
  \definecolor{colorgreen}{rgb}{0.4660, 0.6740, 0.1880}
  \definecolor{colorcyan}{rgb}{0.3010, 0.7450, 0.9330}
  \definecolor{colorbordeau}{rgb}{0.6350, 0.0780, 0.1840}

  % Main color
  \definecolor{maincolor}{RGB}{89, 9, 38}
  \definecolor{secondcolor}{RGB}{20, 9, 89}
#+end_src

* Control
** Blocks
#+begin_src latex
  \tikzset{%
    block/.style n args={2}{%
      draw,
      fill=white,
      minimum width  = #1,
      minimum height = #2,
    },
    block/.default={1.2cm}{1.0cm}
  }
#+end_src

** Branches
#+begin_src latex
  \tikzstyle{branch}=[fill,shape=circle,minimum size=4pt,inner sep=0pt]
  \tikzstyle{->top}=[-{Stealth[color=black, scale=0.8]}, draw=white, double=black, double distance=1pt, line width=1pt]
  \tikzstyle{<-top}=[{stealth[color=black, scale=0.8]}-, draw=white, double=black, double distance=1pt, line width=1pt]
#+end_src

** TODO Hand Writen Style
Usefull for schematic plots
#+begin_src latex
  \tikzstyle{handwriten}=[decorate,decoration={random steps,amplitude=0.1pt,segment length=0.8pt}]
#+end_src

** Dot
#+begin_src latex
  \tikzset{%
    dot/.style{%
      draw,
      circle,
      fill,
      minimum size = #1,
      inner sep = 0pt,
      outer sep = 0pt,
    },
    dot/.default={2pt}
  }
#+end_src

** DAC
#+begin_src latex
  \tikzset{%
    DAC/.style={%
      draw,
      signal,
    }
  }
#+end_src

** ADC
#+begin_src latex
  \tikzset{%
    ADC/.style={%
      draw,
      signal,
      signal to = west,
    }
  }
#+end_src

** TODO Gain
Maybe use =isosceles= instead of regular polygon?
#+begin_src latex
  \tikzset{%
    gain right/.style={%
      draw,
      regular polygon,
      regular polygon sides = 3,
      inner sep = 2pt,
      shape border rotate=-90
    },
    gain left/.style={%
      draw,
      regular polygon,
      regular polygon sides = 3,
      inner sep = 2pt,
      shape border rotate=90
    },
    gain top/.style={%
      draw,
      regular polygon,
      regular polygon sides = 3,
      inner sep = 2pt,
      shape border rotate=0
    },
    gain bottom/.style={%
      draw,
      regular polygon,
      regular polygon sides = 3,
      inner sep = 2pt,
      shape border rotate=180
    },
  }
#+end_src

** Pole
#+begin_src latex
  \tikzset{%
    pole/.style{%
      color=red,
      cross out,
      draw,
      inner sep = 0pt,
      outer sep = 0pt,
      minimum size = #1
    },
    pole/.default={4pt}
  }
#+end_src

** Zero
#+begin_src latex
  \tikzset{%
    zero/.style{%
      color=red,
      circle,
      draw,
      inner sep = 0pt,
      outer sep = 0pt,
      minimum size = #1
    },
    zero/.default={4pt}
  }
#+end_src

