docs/config.html

<div id="outline-container-org12c1bed" class="outline-2">
<h2 id="org12c1bed"><span class="section-number-2">4</span> PGF Plot libraries and config</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\usepgfplotslibrary</span>{patchplots}
<span style="color: #FF5500;">\usepgfplotslibrary</span>{groupplots}

<span style="color: #FF5500;">\pgfplotsset</span>{compat=newest}
<span style="color: #FF5500;">\pgfplotsset</span>{plot coordinates/math parser=false}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2c6418" class="outline-2">
<h2 id="orga2c6418"><span class="section-number-2">5</span> Setup size of figures</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #0000FF;">\newlength</span>{<span style="color: #006699;">\fheight</span>}
<span style="color: #0000FF;">\newlength</span>{<span style="color: #006699;">\fwidth</span>}

<span style="color: #0000FF;">\setlength</span>{<span style="color: #BA36A5;">\fwidth</span>}{<span style="color: #BA36A5;">85mm</span>}
<span style="color: #0000FF;">\setlength</span>{<span style="color: #BA36A5;">\fheight</span>}{<span style="color: #BA36A5;">112mm</span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f4fe8c" class="outline-2">
<h2 id="org1f4fe8c"><span class="section-number-2">6</span> Setup Arrows style</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{&gt;=Stealth}
<span style="color: #8D8D84;">% </span><span style="color: #8D8D84; font-style: italic;">Setup default Linewidth</span>
<span style="color: #FF5500;">\tikzset</span>{every path/.style={line width=1pt}}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5b3a4c" class="outline-2">
<h2 id="orgc5b3a4c"><span class="section-number-2">7</span> Colors</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #0000FF;">\usepackage</span>{<span style="color: #006699;">xcolor</span>}<span style="color: #8D8D84; font-style: italic;">% Color extension</span>

<span style="color: #FF5500;">\definecolor</span>{colorblack}{rgb}{0, 0, 0}
<span style="color: #FF5500;">\definecolor</span>{colorblue}{rgb}{0, 0.4470, 0.7410}
<span style="color: #FF5500;">\definecolor</span>{colorred}{rgb}{0.8500, 0.3250, 0.0980}
<span style="color: #FF5500;">\definecolor</span>{coloryellow}{rgb}{0.9290, 0.6940, 0.1250}
<span style="color: #FF5500;">\definecolor</span>{colorpurple}{rgb}{0.4940, 0.1840, 0.5560}
<span style="color: #FF5500;">\definecolor</span>{colorgreen}{rgb}{0.4660, 0.6740, 0.1880}
<span style="color: #FF5500;">\definecolor</span>{colorcyan}{rgb}{0.3010, 0.7450, 0.9330}
<span style="color: #FF5500;">\definecolor</span>{colorbordeau}{rgb}{0.6350, 0.0780, 0.1840}

<span style="color: #8D8D84;">% </span><span style="color: #8D8D84; font-style: italic;">Main color</span>
<span style="color: #FF5500;">\definecolor</span>{maincolor}{RGB}{89, 9, 38}
<span style="color: #FF5500;">\definecolor</span>{secondcolor}{RGB}{20, 9, 89}
</pre>
</div>
</div>
</div>

<div id="outline-container-org169eb66" class="outline-2">
<h2 id="org169eb66"><span class="section-number-2">8</span> Control</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgbf60a45" class="outline-3">
<h3 id="orgbf60a45"><span class="section-number-3">8.1</span> Blocks</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  block/.style n args={2}{<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    fill=white,
    minimum width  = #1,
    minimum height = #2,
  },
  block/.default={1.2cm}{1.0cm}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge44fac1" class="outline-3">
<h3 id="orge44fac1"><span class="section-number-3">8.2</span> Branches</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzstyle</span>{branch}=[fill,shape=circle,minimum size=4pt,inner sep=0pt]
<span style="color: #FF5500;">\tikzstyle</span>{-&gt;top}=[-{Stealth[color=black, scale=0.8]}, draw=white, double=black, double distance=1pt, line width=1pt]
<span style="color: #FF5500;">\tikzstyle</span>{&lt;-top}=[{stealth[color=black, scale=0.8]}-, draw=white, double=black, double distance=1pt, line width=1pt]
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c172b7" class="outline-3">
<h3 id="org8c172b7"><span class="section-number-3">8.3</span> <span class="todo TODO">TODO</span> Hand Writen Style</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Usefull for schematic plots
</p>
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzstyle</span>{handwriten}=[decorate,decoration={random steps,amplitude=0.1pt,segment length=0.8pt}]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgadbcc0b" class="outline-3">
<h3 id="orgadbcc0b"><span class="section-number-3">8.4</span> Dot</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  dot/.style{<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    circle,
    fill,
    minimum size = #1,
    inner sep = 0pt,
    outer sep = 0pt,
  },
  dot/.default={2pt}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c2d3e7" class="outline-3">
<h3 id="org5c2d3e7"><span class="section-number-3">8.5</span> DAC</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  DAC/.style={<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    signal,
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org245e864" class="outline-3">
<h3 id="org245e864"><span class="section-number-3">8.6</span> ADC</h3>
<div class="outline-text-3" id="text-8-6">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  ADC/.style={<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    signal,
    signal to = west,
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfad8ac6" class="outline-3">
<h3 id="orgfad8ac6"><span class="section-number-3">8.7</span> <span class="todo TODO">TODO</span> Gain</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Maybe use <code>isosceles</code> instead of regular polygon?
</p>
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  gain right/.style={<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    regular polygon,
    regular polygon sides = 3,
    inner sep = 2pt,
    shape border rotate=-90
  },
  gain left/.style={<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    regular polygon,
    regular polygon sides = 3,
    inner sep = 2pt,
    shape border rotate=90
  },
  gain top/.style={<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    regular polygon,
    regular polygon sides = 3,
    inner sep = 2pt,
    shape border rotate=0
  },
  gain bottom/.style={<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    regular polygon,
    regular polygon sides = 3,
    inner sep = 2pt,
    shape border rotate=180
  },
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org64f5f90" class="outline-3">
<h3 id="org64f5f90"><span class="section-number-3">8.8</span> Pole</h3>
<div class="outline-text-3" id="text-8-8">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  pole/.style{<span style="color: #8D8D84; font-style: italic;">%</span>
    color=red,
    cross out,
    draw,
    inner sep = 0pt,
    outer sep = 0pt,
    minimum size = #1
  },
  pole/.default={4pt}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e406e8" class="outline-3">
<h3 id="org6e406e8"><span class="section-number-3">8.9</span> Zero</h3>
<div class="outline-text-3" id="text-8-9">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  zero/.style{<span style="color: #8D8D84; font-style: italic;">%</span>
    color=red,
    circle,
    draw,
    inner sep = 0pt,
    outer sep = 0pt,
    minimum size = #1
  },
  zero/.default={4pt}
}
</pre>
</div>
</div>
</div>
