config.org
** Add / Substract / Divide / Multiply block
#+begin_src latex
  \tikzset{% Add block with Circled operations
    addc/.style n args={5}{%
      draw,
      fill=white,
      circle,
      outer sep = 0pt,
      inner sep = 0pt,
      minimum size = 2em,
      execute at begin node={\LARGE $#1$},
      append after command={\pgfextra{\let\mainnode=\tikzlastnode}
        \ifx#2\empty\else
        node[draw, circle, outer sep=6pt, inner sep=0pt, above left] at (\mainnode.west) {$#2$}%
        \fi
        \ifx#3\empty\else
        node[draw, circle, outer sep=6pt, inner sep=0pt, above right] at (\mainnode.north) {$#3$}%
        \fi
        \ifx#4\empty\else
        node[draw, circle, outer sep=6pt, inner sep=0pt, below right] at (\mainnode.east) {$#4$}%
        \fi
        \ifx#5\empty\else
        node[draw, circle, outer sep=6pt, inner sep=0pt, below left] at (\mainnode.south) {$#5$}%
        \fi
        }
    },
    addc/.default={+}{}{}{}{},
  }
#+end_src

#+begin_src latex
  \tikzset{% Add Block
    addb/.style n args={5}{%
      draw,
      fill=white,
      circle,
      outer sep = 0pt,
      inner sep = 0pt,
      minimum size = 2em,
      execute at begin node={\LARGE $#1$},
      append after command={\pgfextra{\let\mainnode=\tikzlastnode}
        \ifx#2\empty\else
        node[outer sep=2pt, inner sep=0pt, above left] at (\mainnode.west) {$#2$}%
        \fi
        \ifx#3\empty\else
        node[outer sep=2pt, inner sep=0pt, above right] at (\mainnode.north) {$#3$}%
        \fi
        \ifx#4\empty\else
        node[outer sep=2pt, inner sep=0pt, below right] at (\mainnode.east) {$#4$}%
        \fi
        \ifx#5\empty\else
        node[outer sep=2pt, inner sep=0pt, below left] at (\mainnode.south) {$#5$}%
        \fi
        }
    },
    addb/.default={+}{}{}{}{},
  }
#+end_src

* Mechanical
** Spring
#+begin_src latex
  \tikzset{%
    spring/.style={%
      thick,
      decoration={
        zigzag,
        pre length  = #1cm,
        post length = #1cm,
        segment length = 6
      },
      decorate
    },
    spring/.default={0.2}
  }
#+end_src

** Coil
#+begin_src latex
  \tikzset{%
    coil/.style n args={2}{%
      thick,
      decoration={
        coil,
        pre length  = #1cm,
        post length = #2cm,
        segment length = 4
      },
      decorate
    },
    coil/.default={0.3}{0.3}
  }
#+end_src

** Damper
#+begin_src latex
  \tikzset{%
    damper/.style n args={2}{%
      thick,
      decoration={markings, mark connection node=dmp, mark=at position 0.5 with {
          \node (dmp) [thick,
                       inner sep = 0pt,
                       transform shape,
                       rotate  =-90,
                       minimum width  = #1pt,
                       minimum height = #2pt,
                       draw=none] {};
          \draw [thick] ($(dmp.north east)+(0.6*#2pt,0)$) -- (dmp.south east) -- (dmp.south west) -- ($(dmp.north west)+(0.6*#2pt,0)$);
          \draw [thick] ($(dmp.north)+(0,-0.3*#1pt)$) -- ($(dmp.north)+(0,0.3*#1pt)$);
        }
      },
      decorate
    },
    damper/.default={12}{3}
  }
#+end_src

** Actuator
#+begin_src latex
  \tikzset{%
    actuator/.style n args={2}{%
      thick,
      draw=none,
      decoration={
        markings,
        mark connection node=my node,
        mark=at position .5 with {
          \node [draw, inner sep=0pt, minimum width=#1cm, minimum height=#2cm,
          transform shape, fill=white] (my node) {};
        },
        mark=at position .0 with {
          \draw[<-] (0, 0) -- (my node);
        },
        mark=at position 1.0 with {
          \draw[<-] (0, 0) -- (my node);
        }
      },
      decorate
    },
    actuator/.default={0.5}{0.2}
  }
#+end_src

** Ground
#+begin_src latex
  \tikzset{%
    ground/.style n args={2}{%
      fill,
      pattern = north east lines,
      draw = none,
      anchor = north,
      minimum width  = #1cm,
      minimum height = #2cm,
      append after command={
        (\tikzlastnode.north west) edge (\tikzlastnode.north east)
      }
    },
    ground/.default={2.5}{0.3}
  }
#+end_src

** Force Sensor
#+begin_src latex
  \tikzset{%
    forcesensor/.style n args={2}{%
      rectangle,
      outer sep=0pt,
      inner sep=0pt,
      draw=black,
      fill=white!60!black,
      anchor=south,
      minimum width =#1cm,
      minimum height=#2cm,
      append after command={
        [every edge/.append style={
          thick,
          black,
        }]
        (\tikzlastnode.north west) edge (\tikzlastnode.south east)
        (\tikzlastnode.north east) edge (\tikzlastnode.south west)
      }
    },
    forcesensor/.default={2.0}{0.5}
  }
#+end_src

