docs/config.html

<div id="outline-container-org0f5613d" class="outline-3">
<h3 id="org0f5613d"><span class="section-number-3">8.10</span> Add / Substract / Divide / Multiply block</h3>
<div class="outline-text-3" id="text-8-10">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">% Add block with Circled operations</span>
  addc/.style n args={5}{<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    fill=white,
    circle,
    outer sep = 0pt,
    inner sep = 0pt,
    minimum size = 2em,
    execute at begin node={<span style="color: #0000FF;">\LARGE</span><span style="color: #6434A3;"> </span><span style="color: #0000ff;">$#1$</span>},
    append after command={<span style="color: #FF5500;">\pgfextra</span>{<span style="color: #FF5500;">\let\mainnode=\tikzlastnode</span>}
      <span style="color: #FF5500;">\ifx</span>#2<span style="color: #FF5500;">\empty\else</span>
      node[draw, circle, outer sep=6pt, inner sep=0pt, above left] at (<span style="color: #FF5500;">\mainnode</span>.west) {<span style="color: #0000ff;">$#2$</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
      <span style="color: #FF5500;">\fi</span>
      <span style="color: #FF5500;">\ifx</span>#3<span style="color: #FF5500;">\empty\else</span>
      node[draw, circle, outer sep=6pt, inner sep=0pt, above right] at (<span style="color: #FF5500;">\mainnode</span>.north) {<span style="color: #0000ff;">$#3$</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
      <span style="color: #FF5500;">\fi</span>
      <span style="color: #FF5500;">\ifx</span>#4<span style="color: #FF5500;">\empty\else</span>
      node[draw, circle, outer sep=6pt, inner sep=0pt, below right] at (<span style="color: #FF5500;">\mainnode</span>.east) {<span style="color: #0000ff;">$#4$</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
      <span style="color: #FF5500;">\fi</span>
      <span style="color: #FF5500;">\ifx</span>#5<span style="color: #FF5500;">\empty\else</span>
      node[draw, circle, outer sep=6pt, inner sep=0pt, below left] at (<span style="color: #FF5500;">\mainnode</span>.south) {<span style="color: #0000ff;">$#5$</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
      <span style="color: #FF5500;">\fi</span>
      }
  },
  addc/.default={+}{}{}{}{},
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">% Add Block</span>
  addb/.style n args={5}{<span style="color: #8D8D84; font-style: italic;">%</span>
    draw,
    fill=white,
    circle,
    outer sep = 0pt,
    inner sep = 0pt,
    minimum size = 2em,
    execute at begin node={<span style="color: #0000FF;">\LARGE</span><span style="color: #6434A3;"> </span><span style="color: #0000ff;">$#1$</span>},
    append after command={<span style="color: #FF5500;">\pgfextra</span>{<span style="color: #FF5500;">\let\mainnode=\tikzlastnode</span>}
      <span style="color: #FF5500;">\ifx</span>#2<span style="color: #FF5500;">\empty\else</span>
      node[outer sep=2pt, inner sep=0pt, above left] at (<span style="color: #FF5500;">\mainnode</span>.west) {<span style="color: #0000ff;">$#2$</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
      <span style="color: #FF5500;">\fi</span>
      <span style="color: #FF5500;">\ifx</span>#3<span style="color: #FF5500;">\empty\else</span>
      node[outer sep=2pt, inner sep=0pt, above right] at (<span style="color: #FF5500;">\mainnode</span>.north) {<span style="color: #0000ff;">$#3$</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
      <span style="color: #FF5500;">\fi</span>
      <span style="color: #FF5500;">\ifx</span>#4<span style="color: #FF5500;">\empty\else</span>
      node[outer sep=2pt, inner sep=0pt, below right] at (<span style="color: #FF5500;">\mainnode</span>.east) {<span style="color: #0000ff;">$#4$</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
      <span style="color: #FF5500;">\fi</span>
      <span style="color: #FF5500;">\ifx</span>#5<span style="color: #FF5500;">\empty\else</span>
      node[outer sep=2pt, inner sep=0pt, below left] at (<span style="color: #FF5500;">\mainnode</span>.south) {<span style="color: #0000ff;">$#5$</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
      <span style="color: #FF5500;">\fi</span>
      }
  },
  addb/.default={+}{}{}{}{},
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org27aaf30" class="outline-2">
<h2 id="org27aaf30"><span class="section-number-2">9</span> Mechanical</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgd35493b" class="outline-3">
<h3 id="orgd35493b"><span class="section-number-3">9.1</span> Spring</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  spring/.style={<span style="color: #8D8D84; font-style: italic;">%</span>
    thick,
    decoration={
      zigzag,
      pre length  = #1cm,
      post length = #1cm,
      segment length = 6
    },
    decorate
  },
  spring/.default={0.2}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a83c4e" class="outline-3">
<h3 id="org9a83c4e"><span class="section-number-3">9.2</span> Coil</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  coil/.style n args={2}{<span style="color: #8D8D84; font-style: italic;">%</span>
    thick,
    decoration={
      coil,
      pre length  = #1cm,
      post length = #2cm,
      segment length = 4
    },
    decorate
  },
  coil/.default={0.3}{0.3}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge84edbc" class="outline-3">
<h3 id="orge84edbc"><span class="section-number-3">9.3</span> Damper</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  damper/.style n args={2}{<span style="color: #8D8D84; font-style: italic;">%</span>
    thick,
    decoration={markings, mark connection node=dmp, mark=at position 0.5 with {
        <span style="color: #FF5500;">\node</span> (dmp) [thick,
                     inner sep = 0pt,
                     transform shape,
                     rotate  =-90,
                     minimum width  = #1pt,
                     minimum height = #2pt,
                     draw=none] {};
        <span style="color: #FF5500;">\draw</span> [thick] (<span style="color: #0000ff;">$(dmp.north east)+(0.6*#2pt,0)$</span>) -- (dmp.south east) -- (dmp.south west) -- (<span style="color: #0000ff;">$(dmp.north west)+(0.6*#2pt,0)$</span>);
        <span style="color: #FF5500;">\draw</span> [thick] (<span style="color: #0000ff;">$(dmp.north)+(0,-0.3*#1pt)$</span>) -- (<span style="color: #0000ff;">$(dmp.north)+(0,0.3*#1pt)$</span>);
      }
    },
    decorate
  },
  damper/.default={12}{3}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ffebc5" class="outline-3">
<h3 id="org7ffebc5"><span class="section-number-3">9.4</span> Actuator</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  actuator/.style n args={2}{<span style="color: #8D8D84; font-style: italic;">%</span>
    thick,
    draw=none,
    decoration={
      markings,
      mark connection node=my node,
      mark=at position .5 with {
        <span style="color: #FF5500;">\node</span> [draw, inner sep=0pt, minimum width=#1cm, minimum height=#2cm,
        transform shape, fill=white] (my node) {};
      },
      mark=at position .0 with {
        <span style="color: #FF5500;">\draw</span>[&lt;-] (0, 0) -- (my node);
      },
      mark=at position 1.0 with {
        <span style="color: #FF5500;">\draw</span>[&lt;-] (0, 0) -- (my node);
      }
    },
    decorate
  },
  actuator/.default={0.5}{0.2}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org316cb66" class="outline-3">
<h3 id="org316cb66"><span class="section-number-3">9.5</span> Ground</h3>
<div class="outline-text-3" id="text-9-5">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  ground/.style n args={2}{<span style="color: #8D8D84; font-style: italic;">%</span>
    fill,
    pattern = north east lines,
    draw = none,
    anchor = north,
    minimum width  = #1cm,
    minimum height = #2cm,
    append after command={
      (<span style="color: #FF5500;">\tikzlastnode</span>.north west) edge (<span style="color: #FF5500;">\tikzlastnode</span>.north east)
    }
  },
  ground/.default={2.5}{0.3}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org16def75" class="outline-3">
<h3 id="org16def75"><span class="section-number-3">9.6</span> Force Sensor</h3>
<div class="outline-text-3" id="text-9-6">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  forcesensor/.style n args={2}{<span style="color: #8D8D84; font-style: italic;">%</span>
    rectangle,
    outer sep=0pt,
    inner sep=0pt,
    draw=black,
    fill=white!60!black,
    anchor=south,
    minimum width =#1cm,
    minimum height=#2cm,
    append after command={
      [every edge/.append style={
        thick,
        black,
      }]
      (<span style="color: #FF5500;">\tikzlastnode</span>.north west) edge (<span style="color: #FF5500;">\tikzlastnode</span>.south east)
      (<span style="color: #FF5500;">\tikzlastnode</span>.north east) edge (<span style="color: #FF5500;">\tikzlastnode</span>.south west)
    }
  },
  forcesensor/.default={2.0}{0.5}
}
</pre>
</div>
</div>
</div>
