config.org
** Inertial Sensor
#+begin_src latex
  \tikzset{%
    inertialsensor/.style={%
      rectangle,
      outer sep=0pt,
      inner sep=0pt,
      draw=black,
      fill=white!60!black,
      anchor=south east,
      minimum size=#1cm,
      append after command={
        [every edge/.append style={
          thick,
          black,
        }]
        (\tikzlastnode.north west) edge (\tikzlastnode.south east)
        (\tikzlastnode.north east) edge (\tikzlastnode.south west)
      }
    },
    inertialsensor/.default={0.3}
  }
#+end_src

** Axis Rotator
#+begin_src latex
  \newcommand{\AxisRotator}[1][rotate=0]{%
    \tikz [x=0.1cm,y=0.30cm,-stealth,#1] \draw (0,0) arc (-150:150:1 and 1);%
  }
#+end_src

** Cross
#+begin_src latex
  \tikzstyle{cross}=[path picture={
    \draw[black]
    (path picture bounding box.south east) -- (path picture bounding box.north west) (path picture bounding box.south west) -- (path picture bounding box.north east);
  }]

#+end_src

** Voice coil
#+begin_src latex
  \def\voicecoil#1#2#3{
    % ======================
    % Parameters
    % ======================
    \def\voicecoilw{#1} % Total Width
    \def\voicecoilh{#2} % Total Height

    \def\magnetw{\voicecoilw} % Width of the magnet
    \def\magneth{\voicecoilh/1.4} % Height of the magnet

    \def\magnetwb{0.15*\magnetw} % Width of the borders of the magnet
    \def\magnetmw{0.15*\magnetw} % Width of the middle part of the magnet
    \def\magnetwg{0.5*\magnetw} % Width of the gap of the magnet

    \def\magnethl{\magnetwb} % Height of the low part of the magnet
    \def\magnetmh{0.15*\magneth} % Height of the middle part of the magnet
    \def\magnethg{0.2*\magneth} % Height of the gap of the magnet
    % ======================

    \begin{scope}[shift={(0.5*\voicecoilw, 0.5*\voicecoilh)}, rotate=#3, shift={(0, -0.5*\voicecoilh)}]
      % ======================
      % Magnet
      % ======================
      \draw[] (0, 0) -| ++(0.5*\magnetw, \magneth) -| ++(-0.5*\magnetw+0.5*\magnetwg, -\magnethg) -| (0.5*\magnetw-\magnetwb, \magnethl) -| (-0.5*\magnetw+\magnetwb, \magneth-\magnethg) -| (-0.5*\magnetwg, \magneth) -| (-0.5*\magnetw, 0) -- (cycle);
      \begin{scope}[shift={(0, \magnethl)}]
        \draw[fill=red]  (-0.5*\magnetmw, 0) rectangle (0.5*\magnetmw, \magnetmh);
        \draw[fill=blue] (-0.5*\magnetmw, \magnetmh) rectangle (0.5*\magnetmw, 2*\magnetmh);
        % Top conductive Magnet
        \draw[fill=white] (-0.5*\magnetmw, 2*\magnetmh) -| (0.5*\magnetmw, -\magnethl+\magneth-\magnethg) -| ++(0.1, \magnethg) -| ++(-0.2-\magnetmw, -\magnethg) -| (-0.5*\magnetmw, \magnetmh);
      \end{scope}
      % ======================

      % ======================
      % Coil
      % ======================
      \pgfmathsetmacro{\coilwidth}{0.5*0.5*\magnetmw+0.5*0.1+0.25*\magnetwg}%
      \draw[] ( \coilwidth, 0.5*\magneth) -- ++(0, 0.7*\magneth);
      \draw[] (-\coilwidth, 0.5*\magneth) -- ++(0, 0.7*\magneth);
      % Point on the coil
      \foreach \x in {0,1,...,9}
      {
        \node[circle,inner sep=0.6pt,fill] at ( \coilwidth, \x*0.7*\magneth/10+0.5*\magneth);
        \node[circle,inner sep=0.6pt,fill] at (-\coilwidth, \x*0.7*\magneth/10+0.5*\magneth);
      }
      \draw[] (-0.5*\magnetw, 1.2*\magneth) rectangle ++(\magnetw, \magnethg);
      % ======================

      % ======================
      % Coordinates
      % ======================
      % Force
      \coordinate[] (vc_force) at (0, \magneth-0.5*\magnethg);
      % Coil
      \coordinate[] (vc_coil) at (0, \voicecoilh);
      % Magnet
      \coordinate[] (vc_magnet) at (0, 0);
      % Coil Wires
      \coordinate[] (vc_wire_one) at ( \coilwidth, 1.2*\magneth);
      \coordinate[] (vc_wire_two) at (-\coilwidth, 1.2*\magneth);
      % ======================
    \end{scope}
  }
#+end_src

