docs/config.html

<div id="outline-container-orgbb00e6e" class="outline-3">
<h3 id="orgbb00e6e"><span class="section-number-3">9.7</span> Inertial Sensor</h3>
<div class="outline-text-3" id="text-9-7">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzset</span>{<span style="color: #8D8D84; font-style: italic;">%</span>
  inertialsensor/.style={<span style="color: #8D8D84; font-style: italic;">%</span>
    rectangle,
    outer sep=0pt,
    inner sep=0pt,
    draw=black,
    fill=white!60!black,
    anchor=south east,
    minimum size=#1cm,
    append after command={
      [every edge/.append style={
        thick,
        black,
      }]
      (<span style="color: #FF5500;">\tikzlastnode</span>.north west) edge (<span style="color: #FF5500;">\tikzlastnode</span>.south east)
      (<span style="color: #FF5500;">\tikzlastnode</span>.north east) edge (<span style="color: #FF5500;">\tikzlastnode</span>.south west)
    }
  },
  inertialsensor/.default={0.3}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org20d348f" class="outline-3">
<h3 id="org20d348f"><span class="section-number-3">9.8</span> Axis Rotator</h3>
<div class="outline-text-3" id="text-9-8">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #0000FF;">\newcommand</span>{<span style="color: #006699;">\AxisRotator</span>}[<span style="color: #BA36A5;">1</span>][<span style="color: #BA36A5;">rotate=0</span>]{<span style="color: #8D8D84; font-style: italic;">%</span>
<span style="color: #006699;">  </span><span style="color: #006699;">\tikz</span><span style="color: #006699;"> [x=0.1cm,y=0.30cm,-stealth,#1] </span><span style="color: #006699;">\draw</span><span style="color: #006699;"> (0,0) arc (-150:150:1 and 1);</span><span style="color: #8D8D84; font-style: italic;">%</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ec6df7" class="outline-3">
<h3 id="org6ec6df7"><span class="section-number-3">9.9</span> Cross</h3>
<div class="outline-text-3" id="text-9-9">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\tikzstyle</span>{cross}=[path picture={
  <span style="color: #FF5500;">\draw</span>[black]
  (path picture bounding box.south east) -- (path picture bounding box.north west) (path picture bounding box.south west) -- (path picture bounding box.north east);
}]

</pre>
</div>
</div>
</div>

<div id="outline-container-org0f427ff" class="outline-3">
<h3 id="org0f427ff"><span class="section-number-3">9.10</span> Voice coil</h3>
<div class="outline-text-3" id="text-9-10">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #FF5500;">\def\voicecoil</span>#1#2#3{
  <span style="color: #8D8D84; font-style: italic;">% ======================</span>
  <span style="color: #8D8D84; font-style: italic;">% Parameters</span>
  <span style="color: #8D8D84; font-style: italic;">% ======================</span>
  <span style="color: #FF5500;">\def\voicecoilw</span>{#1} <span style="color: #8D8D84; font-style: italic;">% Total Width</span>
  <span style="color: #FF5500;">\def\voicecoilh</span>{#2} <span style="color: #8D8D84; font-style: italic;">% Total Height</span>

  <span style="color: #FF5500;">\def\magnetw</span>{<span style="color: #FF5500;">\voicecoilw</span>} <span style="color: #8D8D84; font-style: italic;">% Width of the magnet</span>
  <span style="color: #FF5500;">\def\magneth</span>{<span style="color: #FF5500;">\voicecoilh/1</span>.4} <span style="color: #8D8D84; font-style: italic;">% Height of the magnet</span>

  <span style="color: #FF5500;">\def\magnetwb</span>{0.15*<span style="color: #FF5500;">\magnetw</span>} <span style="color: #8D8D84; font-style: italic;">% Width of the borders of the magnet</span>
  <span style="color: #FF5500;">\def\magnetmw</span>{0.15*<span style="color: #FF5500;">\magnetw</span>} <span style="color: #8D8D84; font-style: italic;">% Width of the middle part of the magnet</span>
  <span style="color: #FF5500;">\def\magnetwg</span>{0.5*<span style="color: #FF5500;">\magnetw</span>} <span style="color: #8D8D84; font-style: italic;">% Width of the gap of the magnet</span>

  <span style="color: #FF5500;">\def\magnethl</span>{<span style="color: #FF5500;">\magnetwb</span>} <span style="color: #8D8D84; font-style: italic;">% Height of the low part of the magnet</span>
  <span style="color: #FF5500;">\def\magnetmh</span>{0.15*<span style="color: #FF5500;">\magneth</span>} <span style="color: #8D8D84; font-style: italic;">% Height of the middle part of the magnet</span>
  <span style="color: #FF5500;">\def\magnethg</span>{0.2*<span style="color: #FF5500;">\magneth</span>} <span style="color: #8D8D84; font-style: italic;">% Height of the gap of the magnet</span>
  <span style="color: #8D8D84; font-style: italic;">% ======================</span>

  <span style="color: #0000FF;">\begin</span>{<span style="color: #006699;">scope</span>}[shift={(0.5*<span style="color: #FF5500;">\voicecoilw</span>, 0.5*<span style="color: #FF5500;">\voicecoilh</span>)}, rotate=#3, shift={(0, -0.5*<span style="color: #FF5500;">\voicecoilh</span>)}]
    <span style="color: #8D8D84; font-style: italic;">% ======================</span>
    <span style="color: #8D8D84; font-style: italic;">% Magnet</span>
    <span style="color: #8D8D84; font-style: italic;">% ======================</span>
    <span style="color: #FF5500;">\draw</span>[] (0, 0) -| ++(0.5*<span style="color: #FF5500;">\magnetw</span>, <span style="color: #FF5500;">\magneth</span>) -| ++(-0.5*<span style="color: #FF5500;">\magnetw+0</span>.5*<span style="color: #FF5500;">\magnetwg</span>, -<span style="color: #FF5500;">\magnethg</span>) -| (0.5*<span style="color: #FF5500;">\magnetw-\magnetwb</span>, <span style="color: #FF5500;">\magnethl</span>) -| (-0.5*<span style="color: #FF5500;">\magnetw+\magnetwb</span>, <span style="color: #FF5500;">\magneth-\magnethg</span>) -| (-0.5*<span style="color: #FF5500;">\magnetwg</span>, <span style="color: #FF5500;">\magneth</span>) -| (-0.5*<span style="color: #FF5500;">\magnetw</span>, 0) -- (cycle);
    <span style="color: #0000FF;">\begin</span>{<span style="color: #006699;">scope</span>}[shift={(0, <span style="color: #FF5500;">\magnethl</span>)}]
      <span style="color: #FF5500;">\draw</span>[fill=red]  (-0.5*<span style="color: #FF5500;">\magnetmw</span>, 0) rectangle (0.5*<span style="color: #FF5500;">\magnetmw</span>, <span style="color: #FF5500;">\magnetmh</span>);
      <span style="color: #FF5500;">\draw</span>[fill=blue] (-0.5*<span style="color: #FF5500;">\magnetmw</span>, <span style="color: #FF5500;">\magnetmh</span>) rectangle (0.5*<span style="color: #FF5500;">\magnetmw</span>, 2*<span style="color: #FF5500;">\magnetmh</span>);
      <span style="color: #8D8D84; font-style: italic;">% Top conductive Magnet</span>
      <span style="color: #FF5500;">\draw</span>[fill=white] (-0.5*<span style="color: #FF5500;">\magnetmw</span>, 2*<span style="color: #FF5500;">\magnetmh</span>) -| (0.5*<span style="color: #FF5500;">\magnetmw</span>, -<span style="color: #FF5500;">\magnethl+\magneth-\magnethg</span>) -| ++(0.1, <span style="color: #FF5500;">\magnethg</span>) -| ++(-0.2-<span style="color: #FF5500;">\magnetmw</span>, -<span style="color: #FF5500;">\magnethg</span>) -| (-0.5*<span style="color: #FF5500;">\magnetmw</span>, <span style="color: #FF5500;">\magnetmh</span>);
    <span style="color: #0000FF;">\end</span>{<span style="color: #006699;">scope</span>}
    <span style="color: #8D8D84; font-style: italic;">% ======================</span>

    <span style="color: #8D8D84; font-style: italic;">% ======================</span>
    <span style="color: #8D8D84; font-style: italic;">% Coil</span>
    <span style="color: #8D8D84; font-style: italic;">% ======================</span>
    <span style="color: #FF5500;">\pgfmathsetmacro</span>{<span style="color: #FF5500;">\coilwidth</span>}{0.5*0.5*<span style="color: #FF5500;">\magnetmw+0</span>.5*0.1+0.25*<span style="color: #FF5500;">\magnetwg</span>}<span style="color: #8D8D84; font-style: italic;">%</span>
    <span style="color: #FF5500;">\draw</span>[] ( <span style="color: #FF5500;">\coilwidth</span>, 0.5*<span style="color: #FF5500;">\magneth</span>) -- ++(0, 0.7*<span style="color: #FF5500;">\magneth</span>);
    <span style="color: #FF5500;">\draw</span>[] (-<span style="color: #FF5500;">\coilwidth</span>, 0.5*<span style="color: #FF5500;">\magneth</span>) -- ++(0, 0.7*<span style="color: #FF5500;">\magneth</span>);
    <span style="color: #8D8D84; font-style: italic;">% Point on the coil</span>
    <span style="color: #FF5500;">\foreach</span> <span style="color: #FF5500;">\x</span> in {0,1,...,9}
    {
      <span style="color: #FF5500;">\node</span>[circle,inner sep=0.6pt,fill] at ( <span style="color: #FF5500;">\coilwidth</span>, <span style="color: #FF5500;">\x*0</span>.7*<span style="color: #FF5500;">\magneth/10+0</span>.5*<span style="color: #FF5500;">\magneth</span>);
      <span style="color: #FF5500;">\node</span>[circle,inner sep=0.6pt,fill] at (-<span style="color: #FF5500;">\coilwidth</span>, <span style="color: #FF5500;">\x*0</span>.7*<span style="color: #FF5500;">\magneth/10+0</span>.5*<span style="color: #FF5500;">\magneth</span>);
    }
    <span style="color: #FF5500;">\draw</span>[] (-0.5*<span style="color: #FF5500;">\magnetw</span>, 1.2*<span style="color: #FF5500;">\magneth</span>) rectangle ++(<span style="color: #FF5500;">\magnetw</span>, <span style="color: #FF5500;">\magnethg</span>);
    <span style="color: #8D8D84; font-style: italic;">% ======================</span>

    <span style="color: #8D8D84; font-style: italic;">% ======================</span>
    <span style="color: #8D8D84; font-style: italic;">% Coordinates</span>
    <span style="color: #8D8D84; font-style: italic;">% ======================</span>
    <span style="color: #8D8D84; font-style: italic;">% Force</span>
    <span style="color: #FF5500;">\coordinate</span>[] (vc_force) at (0, <span style="color: #FF5500;">\magneth-0</span>.5*<span style="color: #FF5500;">\magnethg</span>);
    <span style="color: #8D8D84; font-style: italic;">% Coil</span>
    <span style="color: #FF5500;">\coordinate</span>[] (vc_coil) at (0, <span style="color: #FF5500;">\voicecoilh</span>);
    <span style="color: #8D8D84; font-style: italic;">% Magnet</span>
    <span style="color: #FF5500;">\coordinate</span>[] (vc_magnet) at (0, 0);
    <span style="color: #8D8D84; font-style: italic;">% Coil Wires</span>
    <span style="color: #FF5500;">\coordinate</span>[] (vc_wire_one) at ( <span style="color: #FF5500;">\coilwidth</span>, 1.2*<span style="color: #FF5500;">\magneth</span>);
    <span style="color: #FF5500;">\coordinate</span>[] (vc_wire_two) at (-<span style="color: #FF5500;">\coilwidth</span>, 1.2*<span style="color: #FF5500;">\magneth</span>);
    <span style="color: #8D8D84; font-style: italic;">% ======================</span>
  <span style="color: #0000FF;">\end</span>{<span style="color: #006699;">scope</span>}
}
</pre>
</div>
</div>
</div>
</div>
